{
  "name": "Yoel Tadmor",
  "contacts": [
    {
      "type": "email",
      "href": "mailto:jtadmor@gmail.com",
      "icon": "icons/Email_Icon.png",
      "content": "jtadmor@gmail.com"
    },
    {
      "type": "github",
      "href": "https://github.com/jtadmor",
      "icon": "icons/GitHub-Mark-32px.png",
      "content": "jtadmor"
    }
  ],
  "description": "Product- and people- oriented engineer. I excel at collaborating with stakeholders to define product vision and technical roadmaps. My ideal organization would be agile, minimally hierarchical, open-minded, forward-looking, and ambitious.",
  "technologies": [
    "Databases: Elasticsearch, Postgres, Timescale, Mongo, Redis",
    "Languages: Javascript / Typescript, Go, Groovy, PHP",
    "Frameworks / Libraries: React, Redux, SlateJS",
    "Web: DOM APIs, HTML, CSS",
    "Testing: Jest, Cypress",
    "Build tools: Webpack"
  ],
  "work-experience": [
    {
      "org": "Tulip Interfaces",
      "title": "Engineer, Team Lead: Data",
      "dates": "Jan 2020 - Present",
      "responsibilities": [
        "Overseeing technical strategy and architecture for team, which owns inflow, storage, analysis and presentation of data within the platform and accessibility of the data within the no-code application builder",
        "Onboarding, mentoring, and growing our engineers and other technical leaders.",
        "Stakeholder management, technical roadmap prioritization."
      ],
      "key-results": [
        "Grew team from 3 to 8 engineers",
        "Identified and optimized performance and stability concerns. For particularly problematic cases, this lead to cutting query times down by 90+%, reducing dropped events by 90+%, and reducing startup time of critical components by 90+%",
        "Designed new data model and data persistence strategy for all data collected within the platform"
      ]
    },
    {
      "org": "Wayfair",
      "title": "Full Stack Developer",
      "dates": "July - Oct, 2019",
      "responsibilities": [
        "Plan and implement new features and A/B tests to improve customer search experience.",
        "Reduce bugs and increase velocity by identifying and improving problem areas in legacy PHP codebase."
      ],
      "key-results": [
        "Improved page-load times by 25% by optimizing Redis reads, generating millions in added revenue",
        "Implemented functional PHP utilities"
      ]
    },
    {
      "org": "Ombud",
      "title": "Full Stack Developer",
      "dates": "Jan 2015 - July, 2019",
      "responsibilities": [
        "End-to-end planning and implementation, including data model design, service / API architecture, UI code and UX design",
        "Developing in-house libraries, utilities and tools for form management, tabular data display, and query handling",
        "Triaging bugs and feature requests in collaboration with customer success team and other stakeholders",
        "Building combination of user-facing and ad-hoc tools for importing complex, semi-structured data into custom data format"
      ],
      "key-results": [
        "Joined as 3rd engineer on team that grew to 10+, built an enterprise-ready sales-enablement platform used by Fortune 500 companies"
      ]
    }
  ],
  "education": [
    {
      "degree": "Full Stack Web Development",
      "institution": "RefactorU Bootcamp",
      "year": "2014",
      "notes": []
    },
    {
      "degree": "J.D.",
      "institution": "Northeastern University",
      "year": "2012",
      "notes": []
    },
    {
      "degree": "B.S. in Mathematics",
      "institution": "University of Illinois",
      "year": "2007",
      "notes": [
        "3.77 GPA. Graduated cum laude with Highest Distinction from Math dept"
      ]
    }
  ]
}
